# Pandas Basic Lecture

### Workshop 19.03.2019

## Importing pandas

import pandas as pd and read in "physical_health_dataset.csv"

In [1]:
import pandas as pd

## Import datasets

In [8]:
df = pd.read_csv('oslo_bors.csv', sep = ';')

In [14]:
df.head(5)

              Selskap  Markedsverdi  Av total(%)
0             Statoil     582219008        23.92
1             Telenor     264106467        10.85
2                 DNB     247740307        10.18
3         Norsk Hydro     129002043         5.30
4  Yara International     102921157         4.23

## Metods built into the dataframe object

### .info( )

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 3 columns):
Selskap         25 non-null object
Markedsverdi    25 non-null int64
Av total(%)     25 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 680.0+ bytes

### .describe( )

In [12]:
df.describe()

       Markedsverdi  Av total(%)
count  2.500000e+01    25.000000
mean   8.013667e+07     3.292800
std    1.242770e+08     5.105648
min    1.256573e+07     0.520000
25%    1.946464e+07     0.800000
50%    2.796244e+07     1.150000
75%    7.745000e+07     3.180000
max    5.822190e+08    23.920000

### .head ( )

In [13]:
df.head(25)

                           Selskap  Markedsverdi  Av total(%)
0                          Statoil     582219008        23.92
1                          Telenor     264106467        10.85
2                              DNB     247740307        10.18
3                      Norsk Hydro     129002043         5.30
4               Yara International     102921157         4.23
5                            Orkla      88697941         3.64
6            Gjensidige Forsikring      77450000         3.18
7                          Aker BP      72706917         2.99
8                   Marine Harvest      68133321         2.80
9                        Schibsted      53826841         2.21
10                      Storebrand      31296755         1.29
11                            Aker      29951710         1.23
12                          SalMar      27962440         1.15
13             Lerøy Seafood Group      26202126         1.08
14  Wallenius Wilhelmsen Logistics      25068968         1.03
15                           Entra      22415360         0.92
16             SpareBank 1 SR-Bank      22250344         0.91
17   TGS-NOPEC Geophysical Company      19875572         0.82
18                   Tomra Systems      19464640         0.80
19               Kongsberg Gruppen      18120000         0.74
20       Olav Thon Eiendomsselskap      17350587         0.71
21        Norwegian Finans Holding      17175379         0.71
22               Austevoll Seafood      13835461         0.57
23                      AF Gruppen      13077794         0.54
24                  Aker Solutions      12565730         0.52

### .tail( )

In [16]:
df.tail(5)

                      Selskap  Markedsverdi  Av total(%)
20  Olav Thon Eiendomsselskap      17350587         0.71
21   Norwegian Finans Holding      17175379         0.71
22          Austevoll Seafood      13835461         0.57
23                 AF Gruppen      13077794         0.54
24             Aker Solutions      12565730         0.52

### .mean()
Similar with max, min, and sum

In [17]:
df.mean()

Markedsverdi    8.013667e+07
Av total(%)     3.292800e+00
dtype: float64

___

<h2 align="center">Series basics</h2>

### Creating a series

In [18]:
my_python_list = [51,52,53,54,55]

pd.Series(data=my_python_list)

0    51
1    52
2    53
3    54
4    55
dtype: int64

In [21]:
pd.Series(data=[1,2,3,4],index=['index 1', 'index 2','index 3', 'index 4'])

index 1    1
index 2    2
index 3    3
index 4    4
dtype: int64

### indexing

In [23]:
my_series = pd.Series(data=my_python_list)

my_series

0    51
1    52
2    53
3    54
4    55
dtype: int64

In [25]:
my_series[0]

51

___

<h2 align="center">Dataframes basics</h2>

### Creating a dataframe

In [53]:
list_matrix = [ [1,2,3],
              [4,5,6],
              [7,8,9]]

my_dataframe = pd.DataFrame(data=list_matrix,index= [0,1,2] ,columns=['Col 1', 'Col 2', 'Col 3'])

In [46]:
my_dataframe.head()

   Col 1  Col 2  Col 3
1      1      2      3
2      4      5      6
3      7      8      9

### Selection and indexing of dataframes

#### Selecting columns

In [54]:
my_dataframe['Col 1']

0    1
1    4
2    7
Name: Col 1, dtype: int64

In [55]:
my_dataframe[ ['Col 1', 'Col 3'] ]

   Col 1  Col 3
0      1      3
1      4      6
2      7      9

#### Selection rows

In [56]:
my_dataframe.iloc[1]

Col 1    4
Col 2    5
Col 3    6
Name: 1, dtype: int64

In [61]:
my_dataframe.iloc[1:3]

   Col 1  Col 2  Col 3  Col 4
1      4      5      6      9
2      7      8      9     15

#### Create new columns

In [82]:
# Create out of existing columns
my_dataframe['Col 4'] = my_dataframe['Col 1'] + my_dataframe['Col 2']
my_dataframe

   Col 1  Col 2  Col 3  Col 5  Col 4
0      1      2      3     10      3
1      4      5      6     11      9
2      7      8      9     12     15

In [72]:
# Create a new column from a python list (need to be same length)
my_dataframe['Col 5'] = [10,11,12]
my_dataframe

   Col 1  Col 2  Col 3  Col 4  Col 5
0      1      2      3      3     10
1      4      5      6      9     11
2      7      8      9     15     12

#### Drop column

In [75]:
my_dataframe.drop('Col 5', axis=1)

   Col 1  Col 2  Col 3  Col 4
0      1      2      3      3
1      4      5      6      9
2      7      8      9     15

In [77]:
my_dataframe

   Col 1  Col 2  Col 3  Col 4  Col 5
0      1      2      3      3     10
1      4      5      6      9     11
2      7      8      9     15     12

In [83]:
my_dataframe.drop('Col 4', axis=1, inplace=True)

In [84]:
my_dataframe

   Col 1  Col 2  Col 3  Col 5
0      1      2      3     10
1      4      5      6     11
2      7      8      9     12

#### Drop row

In [86]:
my_dataframe.drop(1)

   Col 1  Col 2  Col 3  Col 5
0      1      2      3     10
2      7      8      9     12

In [87]:
my_dataframe

   Col 1  Col 2  Col 3  Col 5
0      1      2      3     10
1      4      5      6     11
2      7      8      9     12

In [88]:
my_dataframe.drop(2, inplace=True)

### Sort dataframe by column

In [93]:
df.sort_values('Selskap')

                           Selskap  Markedsverdi  Av total(%)
23                      AF Gruppen      13077794         0.54
11                            Aker      29951710         1.23
7                          Aker BP      72706917         2.99
24                  Aker Solutions      12565730         0.52
22               Austevoll Seafood      13835461         0.57
2                              DNB     247740307        10.18
15                           Entra      22415360         0.92
6            Gjensidige Forsikring      77450000         3.18
19               Kongsberg Gruppen      18120000         0.74
13             Lerøy Seafood Group      26202126         1.08
8                   Marine Harvest      68133321         2.80
3                      Norsk Hydro     129002043         5.30
21        Norwegian Finans Holding      17175379         0.71
20       Olav Thon Eiendomsselskap      17350587         0.71
5                            Orkla      88697941         3.64
12                          SalMar      27962440         1.15
9                        Schibsted      53826841         2.21
16             SpareBank 1 SR-Bank      22250344         0.91
0                          Statoil     582219008        23.92
10                      Storebrand      31296755         1.29
17   TGS-NOPEC Geophysical Company      19875572         0.82
1                          Telenor     264106467        10.85
18                   Tomra Systems      19464640         0.80
14  Wallenius Wilhelmsen Logistics      25068968         1.03
4               Yara International     102921157         4.23

### Applying functions to columns

In [106]:
df['Markedsverdi i milliarder'] = df['Markedsverdi']/1000000

In [99]:
df.head()

              Selskap  Markedsverdi  Av total(%)  Markedsverdi i milliarder
0             Statoil     582219008        23.92                 582.219008
1             Telenor     264106467        10.85                 264.106467
2                 DNB     247740307        10.18                 247.740307
3         Norsk Hydro     129002043         5.30                 129.002043
4  Yara International     102921157         4.23                 102.921157

#### Use the .apply( )

In [108]:
df['Markedsverdi i milliarder'].apply(round)

0     582
1     264
2     248
3     129
4     103
5      89
6      77
7      73
8      68
9      54
10     31
11     30
12     28
13     26
14     25
15     22
16     22
17     20
18     19
19     18
20     17
21     17
22     14
23     13
24     13
Name: Markedsverdi i milliarder, dtype: int64

In [110]:
df.head()

              Selskap  Markedsverdi  Av total(%)  Markedsverdi i milliarder
0             Statoil     582219008        23.92                 582.219008
1             Telenor     264106467        10.85                 264.106467
2                 DNB     247740307        10.18                 247.740307
3         Norsk Hydro     129002043         5.30                 129.002043
4  Yara International     102921157         4.23                 102.921157

In [111]:
df['Av total(%)'].sum()

82.32000000000001

___

# Well done!